

def user_interaction() -> None:
    """Функция для взаимодействия с пользователем"""
    # ( - запрос на создание вакансии )
    # ( - запрос на просмотр вакансии )
    # ( - запрос на запись вакансии в файл )
    # ( - запрос на удаление вакансии из файла )
    # ( - запрос на поиск вакансий из hh.ru по "ключевому слову")
    # ( - запрос топ N-число вакансий по зарплате )
    # ( - запрос на ключевые слова для фильтрации вакансий)
    # ( - запрос на диапазон зарплат )
    # ( - вывести топ N-число вакансий по зарплате с ключевым словом в описании)